transient/base/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// Note: this file is a Copy of $FOAM_TUTORIALS/resources/blockMesh/pitzDaily

convertToMeters 1;

vertices
(
    (-1.473 0.000 1.000)
    (-0.457 0.000 1.000)
    (-0.457 0.000 -1.000)
    (-1.473 0.000 -1.000)
    
    (-1.473 0.264 1.000)
    (-0.457 0.111 1.000)
    (-0.457 0.111 -1.000)
    (-1.473 0.264 -1.000)
    
    (-1.473 -0.264 1.000)
    (-1.473 -0.264 -1.000)
    (-0.457 -0.111 -1.000)
    (-0.457 -0.111 1.000)
    
    (0.457 0.000 1.000)
    (2.134 0.000 1.000)
    (2.134 0.000 -1.000)
    (0.457 0.000 -1.000)
    
    (0.457 0.111 1.000)
    (2.134 0.210 1.000)
    (2.134 0.210 -1.000)
    (0.457 0.111 -1.000)
    
    (0.457 -0.111 1.000)
    (0.457 -0.111 -1.000)
    (2.134 -0.210 -1.000)
    (2.134 -0.210 1.000)
);



blocks
(
    hex (0 1 2 3 4 5 6 7) (200 1 50) simpleGrading (1 1 1)		//Contraction Cone Top
    hex (0 3 2 1 8 9 10 11) (1 200 50) simpleGrading (1 1 1)		//Contraction Cone Bottom
    hex (1 12 15 2 5 16 19 6) (200 1 50) simpleGrading (1 1 1)		//Test Section Top
    hex (11 20 21 10 1 12 15 2) (200 1 50) simpleGrading (1 1 1)		//Test Section Bottom
    hex (12 13 14 15 16 17 18 19) (250 1 50) simpleGrading (1 1 1)	//Diffusion Cone Top
    hex (12 15 14 13 20 21 22 23) (1 250 50) simpleGrading (1 1 1)	//Diffusion Cone Bottom
);

edges
(
);

boundary
(
    inlet
    {
        type patch;
        faces
        (
            (0 4 7 3)
            (8 0 3 9)
        );
    }
    outlet
    {
        type patch;
        faces
        (
            (13 14 18 17)
            (23 22 14 13)
        );
    }
    upperWall
    {
        type wall;
        faces
        (
            (4 5 6 7)
            (5 16 19 6)
            (16 17 18 19)
        );
    }
    lowerWall
    {
        type wall;
        faces
        (
            (8 9 10 11)
            (11 10 21 20)
            (20 21 22 23)
        );
    }
    frontAndBack
    {
        type empty;
        faces
        (
	    (0 1 5 4)
	    (3 7 6 2)
	    (8 11 1 0)
	    (9 3 2 10)
	    (1 12 16 5)
	    (2 6 19 15)
	    (11 20 12 1)
	    (10 2 15 21)
	    (12 13 17 16)
	    (15 19 18 14)
	    (20 23 13 12)
	    (21 15 14 22)
        );
    }
);

// ************************************************************************* //
